<!-- @format -->

<template>
	<p style="user-select: none">
		<strong>В этом приложении:</strong>
	</p>
	<ul class="md-body ul-st">
		<li>Всё приложение на Composition API 🔥;</li>
		<li>Динамические сортировки масива с любыми данными 🔥;</li>
		<li>Универсальные модальные окна и порталы;</li>
		<li>Прелодер, подвешаный на кнопки и страницы;</li>
		<li>Понимание конекста и новый способ работы с emits;</li>
		<li>Работа по REST API с Firebase;</li>
		<li>Запрос, ответ, дожидание ответа;</li>
		<li>GET запросы;</li>
		<li>POST / PUT запросы;</li>
		<li>Полная настройка markdown разметки;</li>
		<li>Работа с axios и настройка своего конфига;</li>
	</ul>
	<p style="user-select: none">
		Сделано на курсе
		<a href="https://tocode.ru/courses/vuejs-3-s-nulya-do-rezultata/">
			"Vue.js 3 c нуля до результата"
		</a>
	</p>
	<router-view></router-view>
</template>
